s='''江安县公安局公安警务辅助人员岗位（一）	T	2016年5月28日(星期六) 上午8:00-12:00		江安职业技术学校	体能测试
江安县公安局公安警务辅助人员岗位（二）	T	2016年5月28日(星期六) 上午8:00-12:00		江安职业技术学校	体能测试
县城镇管理监察大队城市管理协管人员岗位（一）	T	2016年5月28日(星期六) 上午8:00-12:00		江安职业技术学校	体能测试
县城镇管理监察大队城市管理协管岗位（二）	2	2016年5月28日(星期六) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	城镇管理相关法规知识
县城镇管理监察大队数字化城管指挥中心工作员	2	2016年5月28日(星期六) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	城镇管理相关法规知识
县建设监察执法大队建设监察执法辅助人员	2	2016年5月28日(星期六) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	城镇管理相关法规知识
江安县人大常委会办公室	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
中共江安县委办公室	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县纪委（监察局）	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县统一战线工作部	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县党史研究室	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县审计局	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县司法局	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县投资促进局	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县教育局	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
乡镇人民政府综合职位（一）	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
乡镇人民政府综合职位（二）	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县新闻与网络舆情中心	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县残疾人康复活动中心教育培训员	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县残疾人康复活动中心医疗康复指导员	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县安全监测站职业卫生安全监管员	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县烈士陵园管理所	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县成人教育办公室	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
县统计普查中心	1	2016年5月28日(星期六) 上午9:00-11:00	一考室	县政府综合大楼三楼一会议室	公共知识
江安县城市建设投资有限责任公司工程预算及安全管理人员	2	2016年5月29日(星期日) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	公共基础知识
江安县城市建设投资有限责任公司建设工程管理人员	2	2016年5月29日(星期日) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	公共基础知识
江安县城市建设投资有限责任公司施工合同管理人员	2	2016年5月29日(星期日) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	公共基础知识
江安县城市建设投资有限责任公司驾驶员	2	2016年5月29日(星期日) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	公共基础知识
江安县城市建设投资有限责任公司后勤人员	2	2016年5月29日(星期日) 上午9:00-10:30	二考室	县政府综合大楼三楼二会议室	公共基础知识
县政府服务中心政务服务窗口人员	1	2016年5月29日(星期日) 上午9:00-10:30	一考室	县政府综合大楼三楼一会议室	公共基础知识
县总工会社会化工会工作者	1	2016年5月29日(星期日) 上午9:00-10:30	一考室	县政府综合大楼三楼一会议室	公共基础知识
江安县阳春开发责任有限公司工业渣场工作人员	1	2016年5月29日(星期日) 上午9:00-10:30	一考室	县政府综合大楼三楼一会议室	公共基础知识'''
def process(s):
    res={}
    for line in s.split('\n'):
        bkgw, zkz_prefix, kssj, ksh, ksdd, kskm=line.split('\t')
        res[bkgw]={'kssj':kssj, 'ksh':ksh, 'ksdd':ksdd, 'kskm':kskm, 'zkz_prefix':zkz_prefix}
    return res

zkz_dict=process(s)

arr=[
    ['江安县公安局公安警务辅助人员岗位（一）', '江安县公安局公安警务辅助人员岗位（二）', '县城镇管理监察大队城市管理协管人员岗位（一）'], 
    ['县城镇管理监察大队城市管理协管岗位（二）', '县城镇管理监察大队数字化城管指挥中心工作员', '县建设监察执法大队建设监察执法辅助人员'], 
    ['江安县人大常委会办公室', '中共江安县委办公室', '县纪委（监察局）', '县统一战线工作部', '县党史研究室', '县审计局', '县司法局', '县投资促进局', '县教育局', '乡镇人民政府综合职位（一）', '乡镇人民政府综合职位（二）', '县新闻与网络舆情中心', '县残疾人康复活动中心教育培训员', '县残疾人康复活动中心医疗康复指导员', '县安全监测站职业卫生安全监管员', '县烈士陵园管理所', '县成人教育办公室', '县统计普查中心'], 
    ['江安县城市建设投资有限责任公司工程预算及安全管理人员', '江安县城市建设投资有限责任公司建设工程管理人员', '江安县城市建设投资有限责任公司施工合同管理人员', '江安县城市建设投资有限责任公司驾驶员', '江安县城市建设投资有限责任公司后勤人员'], 
    ['县政府服务中心政务服务窗口人员', '县总工会社会化工会工作者', '江安县阳春开发责任有限公司工业渣场工作人员'], 
]

nine='''江安县城市建设投资有限责任公司工程预算及安全管理人员
江安县城市建设投资有限责任公司建设工程管理人员
江安县城市建设投资有限责任公司施工合同管理人员
江安县城市建设投资有限责任公司驾驶员
江安县城市建设投资有限责任公司后勤人员
县政府服务中心政务服务窗口人员
县总工会社会化工会工作者
江安县阳春开发责任有限公司工业渣场工作人员'''.split()

from .models import hetong

def main():
    for bkgws in arr:
        ct=0
        for e in hetong.objects.filter(bkgw__in=bkgws, check_status=1).order_by('bkgw'):
            ct+=1
            num=str(ct).zfill(3)
            zkz_prefix=zkz_dict[e.bkgw]['zkz_prefix']
            if e.bkgw in nine:
                date_suffix='9'
            else:
                date_suffix='8'
            zkz_tmp='%(zkz_prefix)s16052%(date_suffix)s%(num)s'
            e.zkzh=zkz_tmp%locals()
            e.save()